/* Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, 
в которой все заглавные буквы заменены на строчные. */

string first = "AbCdEfG";
string second = first.ToLower();
Console.WriteLine(second);